{
  "pages": [
    {
      "name": "About Me",
      "color": "#000000",
      "cards": [
        {
            "source": "assets/images/profile.png",
            "title": "In General",
            "content": [
                "Hello,<br />",
                "My name is Alessandro, a Computer Science (with Management) student at <a href='https://www.kcl.ac.uk/'>King's College London</a>.",
                "Currently, I am a placement student working in Coventry for PCMS. I am <b>Italian</b>, living in Rome, ",
                "but I moved to London in 2017 to attend University. I love programming because it's very logical and I ",
                "like solving problems, creating algorithms and seeing the results of what I do in real time."
            ]
        },
        {
            "source": "assets/images/contacts.png",
            "title": "Contacts and References",
            "content": [
                "<ul>",
                    "<li>",
                        "<b>Phone:</b> +44 7919824459",
                    "</li>",
                    "<li>",
                        "<b>Email:</b> ale.amantini1997@gmail.com",
                    "</li>",
                    "<li>",
                        "<b>Github:</b> <a href='https://github.com/Amantini1997'>Amantini1997</a>",
                    "</li>",
                    "<li>",
                        "<b>Location:</b> Newcombe Road, CV5 6NL, Coventry, UK",
                    "</li>",
                "</ul>"
            ]
        },
        {
            "source": "assets/images/hobbies.png",
            "title": "Hobbies",
            "content": [
                "My main hobbies are:",
                "<ul>",
                    "<li>",
                        "<b>Programming:</b> when I decided to attend a Computer Science course at University, the main ",
                        "reason was the passion for it. I like everything about programming: the history, the evolution ",
                        "and the logic behind it.",
                    "</li>",
                    "<li>",
                        "<b>Hanging out with friends:</b> At least once a week I go out with friends.",
                    "</li>",
                    "<li>",
                        "<b>Sport:</b> I feel the need to do sport activities, especially when the weather outside is nice.",
                    "</li>",
                    "<li>",
                        "<b>Travel:</b> visiting new places, getting in contact with different population and expending your culture.",
                    "</li>",
                "</ul>"
            ]
        }]
    },
    {
      "name": "Education",
      "color": "#800000",
      "cards": [
        {
            "source": "assets/images/KCL.png",
            "title": "King's College London",
            "content": [
                "<ul>",
                    "<li>",
                        "<b>Start:</b> September 2017",
                    "</li>",
                    "<li>",
                        "<b>End:</b> June 2020<br />",
                    "</li>",
                    "<li>",
                        "<b>Program:</b> Bsci Computer Science with Management and Year in Industry",
                    "</li>",
                    "<li>",
                        "<b>Main Subjects:</b>",
                        "<ul>",
                            "<li>",
                                "Java/Scala/C++/Javascript programming",
                            "</li>",
                            "<li>",
                                "Algorithms and Data structures",
                            "</li>",
                            "<li>",
                                "Databases",
                            "</li>",
                            "<li>",
                                "Operating systems and cuncurrent programming",
                            "</li>",
                            "<li>",
                                "Advanced logic",
                            "</li>",
                        "</ul>", 
                    "</li>",
                "</ul>"
            ]
       }],
      "background" : "assets/images/KCL.png"
    },  
    {
      "name": "Work",
      "color": "#000060",
      "cards": [
        {
            "source": "assets/images/pcms.png",
            "title": "PCMS",
            "content": [
                "<ul>",
                    "<li>",
                        "<b>Company:</b> PCMS",
                    "</li>",
                    "<li>",
                        "<b>Role:</b> Software Developer",
                    "</li>",
                    "<li>",
                        "<b>Start:</b> 1st July 2019",
                    "</li>",
                    "<li>",
                        "<b>End:</b> 31st June 2020 ",
                    "</li>",
                    "<li>",
                        "<b>Experience:</b> working for this company is improving my time management, is teaching me ",
                        "how to work in a big and professional team and is getting me more and more familiar with agile ",
                        "methodologies. The tools and frameworks used are also expanding my technical knwoledge.",
                    "</li>",
                "</ul>"
            ]
        }]
    },
    {
      "name": "Web Development",
      "color": "#006400",
      "cards": [
        {
            "source": "assets/images/CSS-HTML-JS.png",
            "title": "Web Pages",
            "content": [
                "I learnt <b>HTML</b> when I was back in high school, and now I have a solid ",
                "understanding that allows me to easily create web pages. This knwoledge ",
                "is backed up also by a remarkable <b>CSS</b> knwoledge which, alongside <b>Javascript</b>, ",
                "allows me to create powerful and good looking websites."
            ]
        },
        {
            "source": "assets/images/nodejs.png",
            "title": "Node.Js",
            "content": [
                "In order to improve the usage of Javascript, I decided to learn <b>Node.Js</b>: ",
                "I now have a solid understanding of how to use and what it means global ",
                "and local packages, the nvm to upgrade node, and all the main terminal commands."
            ]
        },
        {
            "source": "assets/images/frontend.jpg",
            "title": "Front End",
            "content": [
                "Via Node.js I started to practice with some of its most famous packages:",
                "<ul>",
                    "<li>",
                        "<b>React:</b> it has been my first frontend tool. Here I learnt <b>SCSS</b> precompiler",
                        "and the oneway data binding;",
                    "</li>",
                    "<li>",
                    "<b>Angular:</b> (used to build this website) thanks to this framework I learnt <b>Typescript</b>,",
                    "practised with pipes and learnt the twoways data binding;",
                    "</li>",
                    "<li>",
                        "<b>Ionic:</b> I use this framework in the company I work for to turn web apps into smartphone apps;",
                    "</li>",
                    "<li>",
                        "<b>Mocha and Jasmine:</b> testing tools for javascript.",
                    "</li>" ,
                "<ul>"
            ]
        }]
    },
    {
        "name": "IT Skills",
        "color": "#066b6e",
        "cards": [
            {
                "source": "assets/images/junit.png",
                "title": "Testing",
                "content": [
                    "No good program is ever complete without tests, this is why I learnt some ",
                    "testing frameworks including <b>JUnit</b> and <b>Mockito</b> for Java, and ",
                    "<b>Mocha</b> and <b>Jasmine</b> for Javascript."
                ]
            },
            {
                "source": "assets/images/linux.png",
                "title": "OS",
                "content": [
                    "I have a deep understanding of how <b>operating systems</b> work and I can easily switch ",
                    "from a <b>Linux</b> distro to <b>Windows</b>. Also, I execute most of the commands from the terminal ",
                    "thanks to my good knwoledge of <b>bash</b> and <b>batch</b> commands."
                ]
            },
            {
                "source": "assets/images/ml.jpg",
                "title": "Machine Learning",
                "content": [
                    "Given a solid interest in Machine Learning, I decideced to do some self studies.",
                    "So doing, I ended up learning and practising a lot with <b>python</b> and some of its most ",
                    "popular libraries, i.e. <b>numpy, pandas, matplotlib</b> and <b>scikit</b>. Altough I am still",
                    "spending a lot of time learning ML algorithms, the knowledge about the first 3 libraries is",
                    "already very good."
                ]
            },
            {
                "source": "assets/images/languages.png",
                "title": "Programming Languages",
                "content": [
                    "My University provided me with knwoledge in different languages including:",
                    "<ul>",
                        "<li>",
                            "<b>Java:</b> Java has been my first OOP language. I practised a lot with it, both at University ",
                            "and at work. I have a deep understanding of it and I can be very efficient. My java knowledge ",
                            "extends to <i>Java8</i>, thus, I can easily use lambdas to make my code functional and more elegant. ",
                            "I have also been trained on multi-threading (both in pseudo code and java).",
                        "</li>",
                        "<li>",
                            "<b>C++:</b> working with C++'s syntax, using pointers and references explicitly, had me",
                            "practising a lot on low level machine structure.",
                        "</li>",
                        "<li>",
                            "<b>Scala:</b> this has been my first functional language. I studied it at University for a module ",
                            "it helped me learning how functional languages work and the importance of immutable collections.",
                        "</li>",
                        "<li>",
                            "<b>Python:</b> as mentioned in the machine learning section, my knowledge in python is pretty good, ",
                            "especially when combined with main labraries such as numpy, pandas and matplotlib.",
                        "</li>",
                        "<li>",
                            "<b>Javascript:</b> as mentioned in the web development section, I lately gained a lot of expertise in ",
                            "Javascript using it a lot both at University and work.",
                        "</li>",
                    "<ul>"
                ]
            },
            {
                "source": "assets/images/sql.png",
                "title": "Database",
                "content": [
                    "My IT knowledge includes databases as well, more specifically, I have been ",
                    "trained on the relational database <b>MySql.</b>"
                ]
            }
        ]
    }]
}
